[
    {
        "id": 1,
        "word": "Obfuscate",
        "meaning": "To make something unclear or difficult to understand.",
        "examples": [
            "The writer tends to obfuscate the main point with unnecessary details.",
            "Don't obfuscate the issue by bringing irrelevant facts."
        ]
    },
    {
        "id": 2,
        "word": "Ephemeral",
        "meaning": "Lasting for a very short time.",
        "examples": [
            "The beauty of a rainbow is ephemeral.",
            "Fashion trends are often ephemeral."
        ]
    },
    {
        "id": 3,
        "word": "Acrimonious",
        "meaning": "Angry and bitter in tone or language.",
        "examples": [
            "The debate turned acrimonious after the accusations.",
            "Their acrimonious divorce shocked the family."
        ]
    },
    {
        "id": 4,
        "word": "Languid",
        "meaning": "Displaying or having a disinclination for physical exertion or effort; slow and relaxed.",
        "examples": [
            "She gave a languid stretch after waking up.",
            "The heat made everyone feel languid."
        ]
    },
    {
        "id": 5,
        "word": "Pernicious",
        "meaning": "Having a harmful effect, especially in a gradual or subtle way.",
        "examples": [
            "The pernicious weed spread quickly through the farmland.",
            "Pernicious rumors can destroy reputations."
        ]
    },
    {
        "id": 6,
        "word": "Querulous",
        "meaning": "Complaining in a petulant or whining manner.",
        "examples": [
            "The querulous child wanted a new toy every day.",
            "He became querulous when things didn't go his way."
        ]
    },
    {
        "id": 7,
        "word": "Recalcitrant",
        "meaning": "Having an obstinately uncooperative attitude.",
        "examples": [
            "The recalcitrant student refused to follow the rules.",
            "Dealing with recalcitrant employees requires patience."
        ]
    },
    {
        "id": 8,
        "word": "Sagacious",
        "meaning": "Having or showing keen mental discernment and good judgment.",
        "examples": [
            "The sagacious leader guided the country through crisis.",
            "She offered sagacious advice on financial matters."
        ]
    },
    {
        "id": 9,
        "word": "Tenuous",
        "meaning": "Very weak or slight; insubstantial.",
        "examples": [
            "His argument was based on tenuous evidence.",
            "They had a tenuous hold on power."
        ]
    },
    {
        "id": 10,
        "word": "Ubiquitous",
        "meaning": "Present, appearing, or found everywhere.",
        "examples": [
            "Smartphones are ubiquitous these days.",
            "The brand's logo is ubiquitous in the city."
        ]
    },
    {
        "id": 11,
        "word": "Vociferous",
        "meaning": "Expressing feelings or opinions loudly and forcefully.",
        "examples": [
            "The vociferous crowd cheered the team loudly.",
            "She was vociferous in her opposition to the plan."
        ]
    },
    {
        "id": 12,
        "word": "Winsome",
        "meaning": "Attractive or appealing in appearance or character.",
        "examples": [
            "He had a winsome smile that won hearts.",
            "The puppy’s winsome antics delighted everyone."
        ]
    },
    {
        "id": 13,
        "word": "Xenophobia",
        "meaning": "Dislike or prejudice against people from other countries.",
        "examples": [
            "The community condemned acts of xenophobia.",
            "Xenophobia can lead to social divisions."
        ]
    },
    {
        "id": 14,
        "word": "Yield",
        "meaning": "To produce or provide; to give way under pressure.",
        "examples": [
            "The farm yields a good harvest every year.",
            "The bridge began to yield under the heavy load."
        ]
    },
    {
        "id": 15,
        "word": "Zealous",
        "meaning": "Having or showing great energy or enthusiasm.",
        "examples": [
            "She was a zealous supporter of the charity.",
            "His zealous attitude inspired the whole team."
        ]
    },
    {
        "id": 16,
        "word": "Alacrity",
        "meaning": "Brisk and cheerful readiness.",
        "examples": [
            "He accepted the invitation with alacrity.",
            "She responded to the request with alacrity."
        ]
    },
    {
        "id": 17,
        "word": "Benevolent",
        "meaning": "Well meaning and kindly.",
        "examples": [
            "The benevolent donor helped build a new school.",
            "She has a benevolent nature towards strangers."
        ]
    },
    {
        "id": 18,
        "word": "Capitulate",
        "meaning": "Cease to resist an opponent; surrender.",
        "examples": [
            "The army refused to capitulate despite heavy losses.",
            "They capitulated after a long negotiation."
        ]
    },
    {
        "id": 19,
        "word": "Deleterious",
        "meaning": "Causing harm or damage.",
        "examples": [
            "Smoking has deleterious effects on health.",
            "The chemicals had a deleterious impact on the environment."
        ]
    },
    {
        "id": 20,
        "word": "Ebullient",
        "meaning": "Cheerful and full of energy.",
        "examples": [
            "Her ebullient personality brightened the room.",
            "The team was ebullient after the victory."
        ]
    },
    {
        "id": 21,
        "word": "Eerie",
        "meaning": "Strange and frightening; mysterious in a way that causes unease.",
        "examples": [
            "The abandoned house had an eerie silence at night.",
            "An eerie glow came from the forest after sunset."
        ]
    },
    {
        "id": 22,
        "word": "Macabre",
        "meaning": "Disturbing and horrifying because of involvement with death or injury.",
        "examples": [
            "The macabre decorations made the mansion seem haunted.",
            "She told a macabre tale about the ghost that roams the halls."
        ]
    },
    {
        "id": 23,
        "word": "Phantom",
        "meaning": "A ghost or ghostlike image of a person.",
        "examples": [
            "Locals claimed to see a phantom wandering the old graveyard.",
            "The phantom vanished as quickly as it appeared."
        ]
    },
    {
        "id": 24,
        "word": "Apparition",
        "meaning": "A ghostly figure or unexpected appearance.",
        "examples": [
            "An apparition appeared in the window on the darkest night.",
            "The old legend tells of an apparition guarding the treasure."
        ]
    },
    {
        "id": 25,
        "word": "Sinister",
        "meaning": "Giving the impression that something harmful or evil is happening or will happen.",
        "examples": [
            "There was a sinister shadow lurking in the hallway.",
            "The sinister laughter echoed through the mansion."
        ]
    },
    {
        "id": 26,
        "word": "Forlorn",
        "meaning": "Pitifully sad and abandoned or lonely.",
        "examples": [
            "The forlorn child wandered the empty halls.",
            "A forlorn expression crossed her face as the night deepened."
        ]
    },
    {
        "id": 27,
        "word": "Wraith",
        "meaning": "A ghost or ghostlike image of someone, especially one seen shortly before or after their death.",
        "examples": [
            "The villagers spoke of a wraith that haunted the forest.",
            "A chilling wraith drifted silently past the window."
        ]
    },
    {
        "id": 28,
        "word": "Malevolent",
        "meaning": "Having or showing a wish to do evil to others.",
        "examples": [
            "The malevolent spirit was said to curse anyone who entered.",
            "His malevolent glare sent shivers down their spines."
        ]
    },
    {
        "id": 29,
        "word": "Cacophony",
        "meaning": "A harsh, discordant mixture of sounds.",
        "examples": [
            "A cacophony of screams echoed through the mansion at midnight.",
            "The haunted house was filled with a cacophony of creaks and whispers."
        ]
    },
    {
        "id": 30,
        "word": "Veil",
        "meaning": "Something that covers, separates, or conceals.",
        "examples": [
            "A veil of mist hid the haunted mansion from view.",
            "The truth was hidden behind a veil of mystery."
        ]
    }
]